# BÀI 8: LÀM SẠCH VÀ CHUẨN HÓA DỮ LIỆU

## 1. Làm sạch sơ bộ dữ liệu

### 1.1. Xóa cột và hàng thừa

In [2]:
import numpy as np
import pandas as pd

In [6]:
aqua = pd.DataFrame({
    'year': pd.Series([2020, 2020, 2020, 2020, 2020, 2020]),
    'month_name': pd.Series(['Jan', 'Jan', 'Jun', 'Jun', 'Jul', 'Jul']),
    'month_number': pd.Series([1, 1, 6, 6, 7, 7]),
    'commodity': pd.Series(['Fish', 'Shrimp', 'Fish', 'Shrimp', 'Fish', 'Shrimp']),
    'profit': pd.Series([7415, 3239, 7280, 2007, 3574, 9285]),
    'company': pd.Series(['Pandas', 'Pandas', 'Pandas', 'Pandas', 'Pandas', 'Pandas'])
})
aqua

   year month_name  month_number commodity  profit company
0  2020        Jan             1      Fish    7415  Pandas
1  2020        Jan             1    Shrimp    3239  Pandas
2  2020        Jun             6      Fish    7280  Pandas
3  2020        Jun             6    Shrimp    2007  Pandas
4  2020        Jul             7      Fish    3574  Pandas
5  2020        Jul             7    Shrimp    9285  Pandas

In [7]:
# xóa cột month_name và company
aqua.drop(columns=['month_name', 'company'], index=[0, 1])

   year  month_number commodity  profit
2  2020             6      Fish    7280
3  2020             6    Shrimp    2007
4  2020             7      Fish    3574
5  2020             7    Shrimp    9285

In [8]:
# ghi đè lên dataframe gốc
aqua = aqua.drop(columns=['month_name', 'company'], index=[0, 1])
aqua

   year  month_number commodity  profit
2  2020             6      Fish    7280
3  2020             6    Shrimp    2007
4  2020             7      Fish    3574
5  2020             7    Shrimp    9285

In [5]:
aqua = aqua.reset_index(drop=True)
aqua

   year  month_number commodity  profit
0  2020             6      Fish    7280
1  2020             6    Shrimp    2007
2  2020             7      Fish    3574
3  2020             7    Shrimp    9285

### 1.2. Đổi tên cột
Tên cột nên đổi về dạng không chứa dấu cách và không trùng nhau.

In [6]:
import numpy as np
import pandas as pd

In [7]:
aqua = pd.DataFrame({
    'Year': pd.Series([2020, 2020, 2020, 2020, 2020, 2020]),
    'Month Name': pd.Series(['Jan', 'Jan', 'Jun', 'Jun', 'Jul', 'Jul']),
    'Month Number': pd.Series([1, 1, 6, 6, 7, 7]),
    'Product Name': pd.Series(['Fish', 'Shrimp', 'Fish', 'Shrimp', 'Fish', 'Shrimp']),
    'Profit': pd.Series([7415, 3239, 7280, 2007, 3574, 9285]),
    'Company Name': pd.Series(['Pandas', 'Pandas', 'Pandas', 'Pandas', 'Pandas', 'Pandas'])
})
aqua

   Year Month Name  Month Number Product Name  Profit Company Name
0  2020        Jan             1         Fish    7415       Pandas
1  2020        Jan             1       Shrimp    3239       Pandas
2  2020        Jun             6         Fish    7280       Pandas
3  2020        Jun             6       Shrimp    2007       Pandas
4  2020        Jul             7         Fish    3574       Pandas
5  2020        Jul             7       Shrimp    9285       Pandas

In [8]:
# lấy ra danh sách tên cột
aqua.columns

Index(['Year', 'Month Name', 'Month Number', 'Product Name', 'Profit',
       'Company Name'],
      dtype='object')

In [9]:
# chuyển hết về chữ viết thường
aqua.columns.str.lower()

Index(['year', 'month name', 'month number', 'product name', 'profit',
       'company name'],
      dtype='object')

In [10]:
# thay dấu cách bằng dấu gạch dưới
aqua.columns.str.lower().str.replace(' ', '_')

Index(['year', 'month_name', 'month_number', 'product_name', 'profit',
       'company_name'],
      dtype='object')

In [11]:
# ghi đè lên tên cột cũ
aqua.columns = aqua.columns.str.lower().str.replace(' ', '_')

In [12]:
aqua

   year month_name  month_number product_name  profit company_name
0  2020        Jan             1         Fish    7415       Pandas
1  2020        Jan             1       Shrimp    3239       Pandas
2  2020        Jun             6         Fish    7280       Pandas
3  2020        Jun             6       Shrimp    2007       Pandas
4  2020        Jul             7         Fish    3574       Pandas
5  2020        Jul             7       Shrimp    9285       Pandas

In [13]:
# dùng phương thức rename để đổi tên các cột cụ thể
aqua = aqua.rename(columns={
    'product_name': 'commodity',
    'company_name': 'company'
})

In [14]:
aqua

   year month_name  month_number commodity  profit company
0  2020        Jan             1      Fish    7415  Pandas
1  2020        Jan             1    Shrimp    3239  Pandas
2  2020        Jun             6      Fish    7280  Pandas
3  2020        Jun             6    Shrimp    2007  Pandas
4  2020        Jul             7      Fish    3574  Pandas
5  2020        Jul             7    Shrimp    9285  Pandas

### 1.3. Chuẩn hóa kiểu dữ liệu
Mỗi cột của dataframe cần được chọn đúng kiểu dữ liệu để hoạt động tốt nhất.

In [15]:
import numpy as np
import pandas as pd

In [16]:
athletes = pd.DataFrame({
    'year': [2019, 2019, 2020., 2020, 2020, 2020],
    'date': [20191103, 20190812, 20200125, 20200129, 20200412, 20200220],
    'medal': ['Gold', 'Bronze', 'Silver', 'Bronze', 'Silver', 'Silver'],
    'name': ['Wayne', 'Robert', 'Ashley', 'Jamie', 'Jessie', 'Sergio'],
    'left_handed': [1, 0, 0, 0, 1, 0]
})
athletes

     year      date   medal    name  left_handed
0  2019.0  20191103    Gold   Wayne            1
1  2019.0  20190812  Bronze  Robert            0
2  2020.0  20200125  Silver  Ashley            0
3  2020.0  20200129  Bronze   Jamie            0
4  2020.0  20200412  Silver  Jessie            1
5  2020.0  20200220  Silver  Sergio            0

In [17]:
athletes.dtypes

year           float64
date             int64
medal           object
name            object
left_handed      int64
dtype: object

In [18]:
athletes = athletes.astype({
    'year': int,
    'left_handed': bool
})
athletes

   year      date   medal    name  left_handed
0  2019  20191103    Gold   Wayne         True
1  2019  20190812  Bronze  Robert        False
2  2020  20200125  Silver  Ashley        False
3  2020  20200129  Bronze   Jamie        False
4  2020  20200412  Silver  Jessie         True
5  2020  20200220  Silver  Sergio        False

In [19]:
pd.to_datetime(athletes.date, format='%Y%m%d')

0   2019-11-03
1   2019-08-12
2   2020-01-25
3   2020-01-29
4   2020-04-12
5   2020-02-20
Name: date, dtype: datetime64[ns]

In [20]:
pd.Categorical(athletes.medal, categories=['Gold', 'Silver', 'Bronze'])

[Gold, Bronze, Silver, Bronze, Silver, Silver]
Categories (3, object): [Gold, Silver, Bronze]

In [21]:
athletes.date = pd.to_datetime(athletes.date, format='%Y%m%d')
athletes.medal = pd.Categorical(athletes.medal, categories=['Gold', 'Silver', 'Bronze'])
athletes

   year       date   medal    name  left_handed
0  2019 2019-11-03    Gold   Wayne         True
1  2019 2019-08-12  Bronze  Robert        False
2  2020 2020-01-25  Silver  Ashley        False
3  2020 2020-01-29  Bronze   Jamie        False
4  2020 2020-04-12  Silver  Jessie         True
5  2020 2020-02-20  Silver  Sergio        False

In [22]:
athletes.sort_values(by='medal')

   year       date   medal    name  left_handed
0  2019 2019-11-03    Gold   Wayne         True
2  2020 2020-01-25  Silver  Ashley        False
4  2020 2020-04-12  Silver  Jessie         True
5  2020 2020-02-20  Silver  Sergio        False
1  2019 2019-08-12  Bronze  Robert        False
3  2020 2020-01-29  Bronze   Jamie        False

### 1.4. Xử lý giá trị trùng lặp
Khi xuất hiện nhiều giá trị trùng lặp: hoặc chỉ có 1 giá trị đúng, hoặc tất cả đều sai.

In [1]:
import numpy as np
import pandas as pd

In [2]:
report = pd.DataFrame({
    'year': pd.Series([2019, 2019, 2020, 2020, 2020, 2020]),
    'company': pd.Series(['Pandas', 'Numpy', 'Pandas', 'Numpy', 'Numpy', 'Pandas']),
    'sales': pd.Series([5466, 8558, 8435, 7280, 9285, 6650]),
    'profit': pd.Series([1546, 3546, 3574, 3352, 4678, 2007])
})
report

   year company  sales  profit
0  2019  Pandas   5466    1546
1  2019   Numpy   8558    3546
2  2020  Pandas   6650    2007
3  2020  Pandas   8435    3574
4  2020   Numpy   7280    3352
5  2020   Numpy   9285    4678

Tùy vào nguyên nhân gây ra hiện tượng trùng lặp, bạn cần có các phương án xử lý khác nhau:
1. Liệt kê tất cả bản ghi trùng lặp và chọn xóa thủ công để giữ lại bản ghi đúng
2. Căn cứ vào dấu hiệu nhận biết, chẳng hạn giữ lại bản ghi có thời gian gần nhất hay có giá trị lớn nhất
3. Tính tổng hay trung bình tất cả bản ghi trùng lặp

**Tình huống 1:** Dữ liệu `report` chứa các bản ghi trùng lặp trong 2 cột `year` và `company`. Hãy sử dụng các phương thức của dataframe để thực hiện 3 phương án sau:
1. Liệt kê tất cả bản ghi trùng lặp và chọn xóa thủ công, sử dụng phương thức `duplicated()`
2. Giữ lại bản ghi có giá trị sales lớn nhất, sử dụng phương thức `drop_duplicates()`
3. Tính tổng tất cả bản ghi trùng lặp, sử dụng phương thức `groupby()`

### 1.5. Lọc dữ liệu

In [30]:
import numpy as np
import pandas as pd

In [31]:
ds = pd.DataFrame({
    'worker': [
        'Wayne', 'Robert', 'Ashley',
        'Jamie', 'Jessie', 'Sergio',
        'Harry', 'Johnny', 'Aaron'
    ],
    'age': [8, 37, 25, 26, 80, 30, 20, 31, 28],
    'job': [
        'Student', 'Data Scientist', 'DATA Analyst',
        'data Engineer', 'Retired', 'Business Intelligence',
        'Student', 'Data Analyst', 'AI Engineer'
    ]
})
ds

   worker  age                    job
0   Wayne    8                Student
1  Robert   37         Data Scientist
2  Ashley   25           DATA Analyst
3   Jamie   26          data Engineer
4  Jessie   80                Retired
5  Sergio   30  Business Intelligence
6   Harry   20                Student
7  Johnny   31           Data Analyst
8   Aaron   28            AI Engineer

In [32]:
ds[(ds.age >= 15) & (ds.age <= 60)]

   worker  age                    job
1  Robert   37         Data Scientist
2  Ashley   25           DATA Analyst
3   Jamie   26          data Engineer
5  Sergio   30  Business Intelligence
6   Harry   20                Student
7  Johnny   31           Data Analyst
8   Aaron   28            AI Engineer

In [33]:
ds[ds.job.str.lower().str.contains('data')]

   worker  age             job
1  Robert   37  Data Scientist
2  Ashley   25    DATA Analyst
3   Jamie   26   data Engineer
7  Johnny   31    Data Analyst

**Tình huống 2:** Trong dữ liệu `ds` hãy lọc ra những người mà nghề nghiệp không chứa "data" và từ 18 đến 50 tuổi.

### 1.6. Ánh xạ

In [35]:
import numpy as np
import pandas as pd

In [30]:
students = pd.DataFrame({
    'student_id': ['010001', '030001', '070001', '080001', '110001', '120001'],
    'grade': [1, 3, 7, 8, 11, 12],
    'gender': ['Male', 'Female', 'female', 'Female', 'male', 'female']
})
students

  student_id  grade  gender
0     010001      1    Male
1     030001      3  Female
2     070001      7  female
3     080001      8  Female
4     110001     11    male
5     120001     12  female

#### Ánh xạ bằng dictionary

In [32]:
gender_map = {'female': 0, 'male': 1}

In [35]:
students['is_male'] = students.gender.str.lower().map(gender_map)
students

  student_id  grade  gender  is_male
0     010001      1    Male        1
1     030001      3  Female        0
2     070001      7  female        0
3     080001      8  Female        0
4     110001     11    male        1
5     120001     12  female        0

#### Ánh xạ bằng function

In [26]:
def stage_map(grade):
    if grade in range(1, 6):
        stage = 'Primary'
    if grade in range(6, 10):
        stage = 'Secondary'
    if grade in range(10, 13):
        stage = 'High'
    return stage

In [36]:
students['stage'] = students.grade.map(stage_map)
students

  student_id  grade  gender  is_male      stage
0     010001      1    Male        1    Primary
1     030001      3  Female        0    Primary
2     070001      7  female        0  Secondary
3     080001      8  Female        0  Secondary
4     110001     11    male        1       High
5     120001     12  female        0       High

## 2. Xử lý dữ liệu văn bản

### 2.1. Xử lý dấu cách và xuống dòng
Do thói quen người nhập, các cột văn bản (text) có thể:
- Có dấu cách ở đầu hoặc cuối
- Dùng nhiều dấu cách giữa các từ
- Xuống dòng

In [39]:
import numpy as np
import pandas as pd

In [37]:
trade = pd.DataFrame({
    'year': pd.Series([2017, 2018, 2019, 2020]),
    'country': pd.Series([
        'United\nKingdom_',
        '___  United Kingdom',
        '_United     Kingdom',
        'United Kingdom ____']),
    'export': pd.Series([5466, 8558, 8435, 8435]),
    'import': pd.Series([1546, 3546, 2007, 3574])
})
trade

   year              country  export  import
0  2017     United\nKingdom_    5466    1546
1  2018  ___  United Kingdom    8558    3546
2  2019  _United     Kingdom    8435    2007
3  2020  United Kingdom ____    8435    3574

In [41]:
trade.country.unique()

array(['United\nKingdom_', '___  United Kingdom', '_United     Kingdom',
       'United Kingdom ____'], dtype=object)

In [42]:
trade.country = trade.country.str.strip('_')
trade.country.unique()

array(['United\nKingdom', '  United Kingdom', 'United     Kingdom',
       'United Kingdom '], dtype=object)

In [43]:
trade.country = trade.country.str.split().str.join(' ')
trade.country.unique()

array(['United Kingdom'], dtype=object)

### 2.2. Sửa lỗi chính tả

In [44]:
import numpy as np
import pandas as pd

In [45]:
shrimp = pd.DataFrame({
    'date': ['2020-01-01', '2020-01-02', '2020-01-03'],
    'commodity': ['Shrimp, frozen, chem free', 'Shrimp, frz, chemical-free', 'Prawn, frz, chemical-free'],
    'price': [10, 13, 14],
    'unit': ['usd/kg', 'USD/KG', 'USD/kg']
})
shrimp

         date                   commodity  price    unit
0  2020-01-01   Shrimp, frozen, chem free     10  usd/kg
1  2020-01-02  Shrimp, frz, chemical-free     13  USD/KG
2  2020-01-03   Prawn, frz, chemical-free     14  USD/kg

In [46]:
shrimp.commodity = shrimp.commodity.str.replace('Prawn', 'Shrimp')
shrimp.commodity = shrimp.commodity.str.replace('frz', 'frozen')
shrimp.commodity = shrimp.commodity.str.replace('chem free', 'chemical-free')
shrimp.unit = shrimp.unit.str.replace('usd', 'USD')
shrimp.unit = shrimp.unit.str.replace('KG', 'kg')

In [47]:
shrimp

         date                      commodity  price    unit
0  2020-01-01  Shrimp, frozen, chemical-free     10  USD/kg
1  2020-01-02  Shrimp, frozen, chemical-free     13  USD/kg
2  2020-01-03  Shrimp, frozen, chemical-free     14  USD/kg

### 2.3. Xử lý số điện thoại và mã số

In [44]:
import numpy as np
import pandas as pd

In [48]:
info = pd.DataFrame({
    'customer_id': [3, 423, 5464],
    'phone': [363334444, 913334444, 123334444],
    'name': ['Jack', 'James', 'Gabriel'],
    'information': ['England Male', 'Colombia Male', 'France Female']
})
info

   customer_id      phone     name    information
0            3  363334444     Jack   England Male
1          423  913334444    James  Colombia Male
2         5464  123334444  Gabriel  France Female

In [49]:
info = info.astype(str)

In [50]:
info.customer_id = info.customer_id.str.pad(width=4, fillchar='0')

In [51]:
info

  customer_id       phone     name    information
0        0003  0363334444     Jack   England Male
1        0423  0913334444    James  Colombia Male
2        5464  0123334444  Gabriel  France Female

**Tình huống 3:** Thêm số "0" vào đầu cột số điện thoại của dữ liệu `info`.

### 2.4. Tách cột (Optional)

In [52]:
info = pd.DataFrame({
    'customer_id': [3, 423, 5464],
    'phone': [363334444, 913334444, 123334444],
    'name': ['Jack', 'James', 'Gabriel'],
    'information': ['England Male', 'Colombia Male', 'France Female']
})
info

   customer_id      phone     name    information
0            3  363334444     Jack   England Male
1          423  913334444    James  Colombia Male
2         5464  123334444  Gabriel  France Female

In [53]:
info['information'].str.split()

0     [England, Male]
1    [Colombia, Male]
2    [France, Female]
Name: information, dtype: object

In [54]:
# unpacking
info['nationality'], info['gender'] = info['information'].str.split().str

In [55]:
info

   customer_id      phone     name    information nationality  gender
0            3  363334444     Jack   England Male     England    Male
1          423  913334444    James  Colombia Male    Colombia    Male
2         5464  123334444  Gabriel  France Female      France  Female

### 2.5. Ghép cột

In [56]:
football = pd.DataFrame({
    'first_name': ['Wayne', 'Cristiano', 'Lionel'],
    'last_name': ['Rooney', 'Ronaldo', 'Messi'],
    'position': ['Second Striker', 'Left Winger', 'Right Winger']
})
football

  first_name last_name        position
0      Wayne    Rooney  Second Striker
1  Cristiano   Ronaldo     Left Winger
2     Lionel     Messi    Right Winger

In [57]:
football['player'] = football.first_name + ' ' + football.last_name

In [58]:
football

  first_name last_name        position             player
0      Wayne    Rooney  Second Striker       Wayne Rooney
1  Cristiano   Ronaldo     Left Winger  Cristiano Ronaldo
2     Lionel     Messi    Right Winger       Lionel Messi

**Tình huống 4:** Ghép 2 cột `prefix` và `suffix` để tạo ra cột `id` cho dữ liệu dưới đây. Chú ý cột `suffix` có 4 chữ số, nếu có ít hơn cần được lấp đầy bằng ký tự 0.

In [44]:
customer_id = pd.DataFrame({
    'prefix': ['VN', 'UK', 'US', 'VN', 'JP', 'RU'],
    'suffix': [4686, 3336, 553, 6564, 864, 63]
})

## 3. Xử lý dữ liệu ngày tháng

#### Các ký hiệu định dạng ngày tháng:
Ký hiệu|Ý nghĩa                         |Ví dụ                               |
:------|:-------------------------------|:-----------------------------------|
`%a`   |Tên ngày trong tuần, viết tắt   |Mon, Tue, Wed,...                   |
`%A`   |Tên ngày trong tuần, viết đầy đủ|Monday, Tuesday, Wednesday,...      |
`%b`   |Tên tháng, viết tắt             |Jan, Feb, Mar,...                   |
`%B`   |Tên tháng, viết đầy đủ          |January, February, March,...        |
`%d`   |Ngày trong tháng, 2 chữ số      |01, 02, 03,..., 31                  |
`%m`   |Tháng, 2 chữ số                 |01, 02, 03,..., 12                  |
`%y`   |Năm, 2 chữ số                   |00, 01, 02,..., 99                  |
`%Y`   |Năm, 4 chữ số                   |0001, 0002,..., 2019, 2020,..., 9999|
`%W`   |Tuần trong năm, 2 chữ số        |00, 01, 02,..., 53                  |
`%H`   |Giờ, hệ 24h, 2 chữ số           |00, 01, 02,..., 23                  |
`%I`   |Giờ, hệ 12h, 2 chữ số           |01, 02, 03,..., 12                  |
`%p`   |Buổi (sáng/chiều)               |AM, PM                              |
`%M`   |Phút, 2 chữ số                  |00, 01, 02,..., 59                  |
`%S`   |Giây, 2 chữ số                  |00, 01, 02,..., 59                  |

### 3.1. Thuộc tính ngày tháng gốc
Cột ngày tháng gốc có kiểu dữ liệu `datetime64` với định dạng `YYYY-MM-DD`. Đây là rất thông tin rất quan trọng, được dùng để tạo ra các cột khác như: năm, quý, tháng, tuần, ngày,...

In [59]:
import numpy as np
import pandas as pd

In [60]:
sales = pd.DataFrame({
    'date': ['2020.01.01', '2020.01.02', '2020.01.03'],
    'profit': [134, 185, 206]
})
sales

         date  profit
0  2020.01.01     134
1  2020.01.02     185
2  2020.01.03     206

In [61]:
sales = pd.DataFrame({
    'date': ['2020.01.01', '2020.01.02', '2020.01.03'],
    'profit': [134, 185, 206]
})
sales.date = pd.to_datetime(sales.date)
sales

        date  profit
0 2020-01-01     134
1 2020-01-02     185
2 2020-01-03     206

In [62]:
sales = pd.DataFrame({
    'date': ['2020.01.01', '2020.01.02', '2020.01.03'],
    'profit': [134, 185, 206]
})
sales.date = pd.to_datetime(sales.date, format='%Y.%d.%m') # chỉ rõ vị trí năm, tháng, ngày
sales

        date  profit
0 2020-01-01     134
1 2020-02-01     185
2 2020-03-01     206

In [63]:
sales = pd.DataFrame({
    'day': [1, 2, 3],
    'month': [1, 1, 1],
    'year': [2020, 2020, 2020],
    'profit': [134, 185, 206]
})
sales['date'] = pd.to_datetime(sales[['day', 'month', 'year']]) # gộp 3 cột day, month, year thành 1 cột date
sales[['date', 'profit']]

        date  profit
0 2020-01-01     134
1 2020-01-02     185
2 2020-01-03     206

### 3.2. Thay đổi định dạng ngày tháng (Optional)

In [64]:
import numpy as np
import pandas as pd

In [65]:
sales = pd.DataFrame({
    'date': pd.date_range(start='2020-01-01', end='2020-01-03', freq='D'),
    'profit': [134, 185, 206]
})
sales

        date  profit
0 2020-01-01     134
1 2020-01-02     185
2 2020-01-03     206

In [66]:
sales['date_print'] = sales.date.dt.strftime('%b %d, %Y')
sales

        date  profit    date_print
0 2020-01-01     134  Jan 01, 2020
1 2020-01-02     185  Jan 02, 2020
2 2020-01-03     206  Jan 03, 2020

In [67]:
sales.dtypes

date          datetime64[ns]
profit                 int64
date_print            object
dtype: object

**Chú ý:** Cột ngày tháng gốc `date` được dùng để tính toán, cột `date_print` chỉ mang ý nghĩa hiển thị.

### 3.3. Trích xuất thuộc tính năm, quý, tháng, tuần

In [68]:
import numpy as np
import pandas as pd

In [69]:
calendar = pd.DataFrame({
    'date': pd.date_range('2020-01-01', '2020-12-31')
})
calendar

          date
0   2020-01-01
1   2020-01-02
2   2020-01-03
3   2020-01-04
4   2020-01-05
..         ...
361 2020-12-27
362 2020-12-28
363 2020-12-29
364 2020-12-30
365 2020-12-31

[366 rows x 1 columns]

In [70]:
# tách năm
calendar.date.dt.to_period('Y')

0      2020
1      2020
2      2020
3      2020
4      2020
       ...
361    2020
362    2020
363    2020
364    2020
365    2020
Name: date, Length: 366, dtype: period[A-DEC]

In [71]:
# tách quý
calendar.date.dt.to_period('Q')

0      2020Q1
1      2020Q1
2      2020Q1
3      2020Q1
4      2020Q1
        ...
361    2020Q4
362    2020Q4
363    2020Q4
364    2020Q4
365    2020Q4
Name: date, Length: 366, dtype: period[Q-DEC]

In [72]:
# tách tháng
calendar.date.dt.to_period('M')

0      2020-01
1      2020-01
2      2020-01
3      2020-01
4      2020-01
        ...
361    2020-12
362    2020-12
363    2020-12
364    2020-12
365    2020-12
Name: date, Length: 366, dtype: period[M]

In [73]:
# tách tuần
calendar.date.dt.strftime('%Y-%U')

0      2020-00
1      2020-00
2      2020-00
3      2020-00
4      2020-01
        ...
361    2020-52
362    2020-52
363    2020-52
364    2020-52
365    2020-52
Name: date, Length: 366, dtype: object

In [74]:
calendar['year'] = calendar.date.dt.to_period('Y').astype(int)
calendar['quarter'] = calendar.date.dt.to_period('Q').astype(str).str.replace('Q', '-')
calendar['month'] = calendar.date.dt.to_period('M').astype(str)
calendar['week'] = calendar.date.dt.strftime('%Y-%U')
calendar

          date  year quarter    month     week
0   2020-01-01  2020  2020-1  2020-01  2020-00
1   2020-01-02  2020  2020-1  2020-01  2020-00
2   2020-01-03  2020  2020-1  2020-01  2020-00
3   2020-01-04  2020  2020-1  2020-01  2020-00
4   2020-01-05  2020  2020-1  2020-01  2020-01
..         ...   ...     ...      ...      ...
361 2020-12-27  2020  2020-4  2020-12  2020-52
362 2020-12-28  2020  2020-4  2020-12  2020-52
363 2020-12-29  2020  2020-4  2020-12  2020-52
364 2020-12-30  2020  2020-4  2020-12  2020-52
365 2020-12-31  2020  2020-4  2020-12  2020-52

[366 rows x 5 columns]

### 3.4. Trích xuất các thuộc tính chu kỳ

In [75]:
import numpy as np
import pandas as pd

In [76]:
calendar = pd.DataFrame({
    'date': pd.date_range('2020-01-01', '2020-12-31')
})
calendar

          date
0   2020-01-01
1   2020-01-02
2   2020-01-03
3   2020-01-04
4   2020-01-05
..         ...
361 2020-12-27
362 2020-12-28
363 2020-12-29
364 2020-12-30
365 2020-12-31

[366 rows x 1 columns]

In [77]:
calendar['weekday'] = calendar.date.dt.weekday_name    # tên ngày trong tuần
calendar['day_of_year'] = calendar.date.dt.dayofyear   # ngày trong năm
calendar['month_of_year'] = calendar.date.dt.month     # tháng trong năm
calendar['quarter_of_year'] = calendar.date.dt.quarter # quý trong năm
calendar

          date    weekday  day_of_year  month_of_year  quarter_of_year
0   2020-01-01  Wednesday            1              1                1
1   2020-01-02   Thursday            2              1                1
2   2020-01-03     Friday            3              1                1
3   2020-01-04   Saturday            4              1                1
4   2020-01-05     Sunday            5              1                1
..         ...        ...          ...            ...              ...
361 2020-12-27     Sunday          362             12                4
362 2020-12-28     Monday          363             12                4
363 2020-12-29    Tuesday          364             12                4
364 2020-12-30  Wednesday          365             12                4
365 2020-12-31   Thursday          366             12                4

[366 rows x 5 columns]

### 3.5. Khoảng thời gian (Timedelta)

In [78]:
import numpy as np
import pandas as pd

#### Chênh lệnh giữa 2 thời điểm

In [79]:
pd.date_range('2020-01-02', '2020-02-29', freq='W')

DatetimeIndex(['2020-01-05', '2020-01-12', '2020-01-19', '2020-01-26',
               '2020-02-02', '2020-02-09', '2020-02-16', '2020-02-23'],
              dtype='datetime64[ns]', freq='W-SUN')

In [80]:
delta = pd.DataFrame({
    'date1': pd.date_range('2020-01-01', '2020-01-31', freq='3D'),
    'date2': pd.date_range('2020-01-02', '2020-03-15', freq='W')
})
delta

        date1      date2
0  2020-01-01 2020-01-05
1  2020-01-04 2020-01-12
2  2020-01-07 2020-01-19
3  2020-01-10 2020-01-26
4  2020-01-13 2020-02-02
5  2020-01-16 2020-02-09
6  2020-01-19 2020-02-16
7  2020-01-22 2020-02-23
8  2020-01-25 2020-03-01
9  2020-01-28 2020-03-08
10 2020-01-31 2020-03-15

In [81]:
delta['timedelta'] = delta.date2 - delta.date1
delta

        date1      date2 timedelta
0  2020-01-01 2020-01-05    4 days
1  2020-01-04 2020-01-12    8 days
2  2020-01-07 2020-01-19   12 days
3  2020-01-10 2020-01-26   16 days
4  2020-01-13 2020-02-02   20 days
5  2020-01-16 2020-02-09   24 days
6  2020-01-19 2020-02-16   28 days
7  2020-01-22 2020-02-23   32 days
8  2020-01-25 2020-03-01   36 days
9  2020-01-28 2020-03-08   40 days
10 2020-01-31 2020-03-15   44 days

#### Tính toán bằng timedelta

In [82]:
import numpy as np
import pandas as pd

In [83]:
delta = pd.DataFrame({
    'date1': pd.date_range('2020-01-01', '2020-01-31', freq='3D'),
    'date2': pd.date_range('2020-01-02', '2020-03-15', freq='W')
})

In [84]:
delta['date3'] = delta.date1 + pd.Timedelta('15 days')
delta

        date1      date2      date3
0  2020-01-01 2020-01-05 2020-01-16
1  2020-01-04 2020-01-12 2020-01-19
2  2020-01-07 2020-01-19 2020-01-22
3  2020-01-10 2020-01-26 2020-01-25
4  2020-01-13 2020-02-02 2020-01-28
5  2020-01-16 2020-02-09 2020-01-31
6  2020-01-19 2020-02-16 2020-02-03
7  2020-01-22 2020-02-23 2020-02-06
8  2020-01-25 2020-03-01 2020-02-09
9  2020-01-28 2020-03-08 2020-02-12
10 2020-01-31 2020-03-15 2020-02-15

## Thang đo dữ liệu

Measurement |Thang đo  |Phân loại   |So sánh |Chênh lệch|Tỉ lệ   |Ví dụ|
:-----------|:---------|:-----------|:------:|:--------:|:------:|:----|
**Nominal** |Định danh |Định tính   |        |          |        |Cam, Táo, Lê - không so sánh được|
**Ordinal** |Thứ bậc   |Định tính   |&#10004;|          |        |(Huy chương) Vàng, Bạc, Đồng - có thứ tự cao thấp|
**Interval**|Khoảng    |Định lượng  |&#10004;|&#10004;  |        |6h00, 12h00, 18h00 - tính được khoảng cách nhưng không tính được tỉ lệ|
**Ratio**   |Tỉ lệ     |Định lượng  |&#10004;|&#10004;  |&#10004;|10 kg, 20 kg, 50 kg - tính được cả chênh lệch và tỉ lệ|

## Giải đáp tình huống

**Tình huống 1:** Dữ liệu `report` chứa các bản ghi trùng lặp trong 2 cột `year` và `company`. Hãy sử dụng các phương thức của dataframe để thực hiện 3 phương án sau:
1. Liệt kê tất cả bản ghi trùng lặp và chọn xóa thủ công, sử dụng phương thức `duplicated()`
2. Giữ lại bản ghi có giá trị sales lớn nhất, sử dụng phương thức `drop_duplicates()`
3. Tính tổng tất cả bản ghi trùng lặp, sử dụng phương thức `groupby()`

In [1]:
import numpy as np
import pandas as pd

In [2]:
report = pd.DataFrame({
    'year': pd.Series([2019, 2019, 2020, 2020, 2020, 2020]),
    'company': pd.Series(['Pandas', 'Numpy', 'Pandas', 'Numpy', 'Numpy', 'Pandas']),
    'sales': pd.Series([5466, 8558, 8435, 7280, 9285, 6650]),
    'profit': pd.Series([1546, 3546, 3574, 3352, 4678, 2007])
})
report

   year company  sales  profit
0  2019  Pandas   5466    1546
1  2019   Numpy   8558    3546
2  2020  Pandas   8435    3574
3  2020   Numpy   7280    3352
4  2020   Numpy   9285    4678
5  2020  Pandas   6650    2007

In [7]:
# tạo biến subset là các cột để xác định giá trị trùng lặp
subset = ['year', 'company']

Phương án 1: Liệt kê tất cả bản ghi trùng lặp và chọn xóa thủ công

In [6]:
# liệt kê các bản ghi trùng lặp
report[report.duplicated(subset, keep=False)].sort_values(subset)

   year company  sales  profit
3  2020   Numpy   7280    3352
4  2020   Numpy   9285    4678
2  2020  Pandas   6650    2007
5  2020  Pandas   8435    3574

In [8]:
# xóa các dòng 2, 4 hoặc các dòng khác tùy ý
report.drop(index=[4, 2])

   year company  sales  profit
0  2019  Pandas   5466    1546
1  2019   Numpy   8558    3546
3  2020   Numpy   7280    3352
5  2020  Pandas   8435    3574

Phương án 2: Chỉ giữ lại bản ghi có giá trị sales lớn nhất

In [15]:
report\
    .sort_values(by=['year', 'company', 'sales'])\
    .drop_duplicates(subset=subset, keep='last')

   year company  sales  profit
1  2019   Numpy   8558    3546
0  2019  Pandas   5466    1546
4  2020   Numpy   9285    4678
2  2020  Pandas   8435    3574

Phương án 3: Tính tổng các bản ghi trùng lặp

In [17]:
report.groupby(by=['year', 'company']).sum().reset_index()

   year company  sales  profit
0  2019   Numpy   8558    3546
1  2019  Pandas   5466    1546
2  2020   Numpy  16565    8030
3  2020  Pandas  15085    5581

**Tình huống 2:** Trong dữ liệu `ds` hãy lọc ra những người mà nghề nghiệp không chứa "data" và từ 18 đến 50 tuổi.

In [30]:
import numpy as np
import pandas as pd

In [31]:
ds = pd.DataFrame({
    'worker': [
        'Wayne', 'Robert', 'Ashley',
        'Jamie', 'Jessie', 'Sergio',
        'Harry', 'Johnny', 'Aaron'
    ],
    'age': [8, 37, 25, 26, 80, 30, 20, 31, 28],
    'job': [
        'Student', 'Data Scientist', 'DATA Analyst',
        'data Engineer', 'Retired', 'Business Intelligence',
        'Student', 'Data Analyst', 'AI Engineer'
    ]
})
ds

   worker  age                    job
0   Wayne    8                Student
1  Robert   37         Data Scientist
2  Ashley   25           DATA Analyst
3   Jamie   26          data Engineer
4  Jessie   80                Retired
5  Sergio   30  Business Intelligence
6   Harry   20                Student
7  Johnny   31           Data Analyst
8   Aaron   28            AI Engineer

In [34]:
ds[~ds.job.str.lower().str.contains('data')]

   worker  age                    job
0   Wayne    8                Student
4  Jessie   80                Retired
5  Sergio   30  Business Intelligence
6   Harry   20                Student
8   Aaron   28            AI Engineer

**Tình huống 3:** Thêm số "0" vào đầu cột số điện thoại của dữ liệu `info`.

In [38]:
import numpy as np
import pandas as pd

In [41]:
info = pd.DataFrame({
    'customer_id': [3, 423, 5464],
    'phone': [363334444, 913334444, 123334444],
    'name': ['Jack', 'James', 'Gabriel'],
    'information': ['England Male', 'Colombia Male', 'France Female']
})
info

   customer_id      phone     name    information
0            3  363334444     Jack   England Male
1          423  913334444    James  Colombia Male
2         5464  123334444  Gabriel  France Female

In [43]:
info.phone = info.astype(str).phone.str.pad(width=10, fillchar='0')
info

   customer_id       phone     name    information
0            3  0363334444     Jack   England Male
1          423  0913334444    James  Colombia Male
2         5464  0123334444  Gabriel  France Female

**Tình huống 4:** Ghép 2 cột `prefix` và `suffix` để tạo ra cột `id` cho dữ liệu dưới đây. Chú ý cột `suffix` có 4 chữ số, nếu có ít hơn cần được lấp đầy bằng ký tự 0.

In [45]:
customer_id = pd.DataFrame({
    'prefix': ['VN', 'UK', 'US', 'VN', 'JP', 'RU'],
    'suffix': [4686, 3336, 553, 6564, 864, 63]
})
customer_id

  prefix  suffix
0     VN    4686
1     UK    3336
2     US     553
3     VN    6564
4     JP     864
5     RU      63

In [47]:
customer_id.suffix.astype(str).str.pad(width=4, fillchar='0')

0    4686
1    3336
2    0553
3    6564
4    0864
5    0063
Name: suffix, dtype: object

In [50]:
customer_id['id'] = customer_id.prefix + customer_id.suffix.astype(str).str.pad(width=4, fillchar='0')
customer_id

  prefix  suffix      id
0     VN    4686  VN4686
1     UK    3336  UK3336
2     US     553  US0553
3     VN    6564  VN6564
4     JP     864  JP0864
5     RU      63  RU0063